# Задача 6
# Вы пользуетесь общественным транспортом? 
# Вероятно, вы расплачивались за проезд и получали билет с номером. 
# Счастливым билетом называют такой билет с шестизначным номером, 
# где сумма первых трех цифр равна сумме последних трех. 
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. 
# Вам требуется написать программу, которая проверяет счастливость билета.
# Пример:
# 385916 -> yes
# 123456 -> no
while True:
    bilet = input('Введите номер билета 000000: ')
    if bilet.isdigit() and len(bilet) == 6:
        if bilet[0] + bilet[1] + bilet[2] == bilet[3] + bilet[4] + bilet[5]:
            print('Это счастливый билет!')
        else:
            print('Не повезло(')
        break
    else:
        print('Некорректный номер билета. Попробуйте еще раз!')